docs/posts/2010-10-22-the-christian-literary-underground.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 27, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Christian Literary Underground</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Christian Literary Underground</h1>
<p class="subtitle" role="doc-subtitle">Oct 22, 2010</p>
</header><p>
The November issue of <a href="http://www.sojo.net/index.cfm?action=magazine.article&amp;amp;issue=soj1011&amp;amp;article=the-borderlands-of-publishing"><i>Sojourners</i> Magazine</a> has an interesting article by Julie Polter about the &ldquo;Christian literary underground.&rdquo; There is also a <a href="http://blog.sojo.net/2010/10/21/7-essential-tips-for-fitting-in-with-the-christian-literary-underground-scene-near-you/">slightly tongue-in-cheek post</a> on their website by Betsy Shirley titled &ldquo;7 Essential Tips for Fitting in With the Christian Literary Underground Scene Near You!&rdquo; I&rsquo;m pleased to see that the first essential tip is this:
</p>


<blockquote>
<p>
Be seen reading the grittier classics of Christian literature. Though <i>Blue Like Jazz</i> is an almost irresistible first choice, try for something more subtle, like Flannery O’Connor, J.D. Salinger, or T.S. Eliot. And when all else fails, <i>The Brothers Karamazov</i> is a sure-bet.
</p>
</blockquote>


<p>
I&rsquo;m glad to see that we&rsquo;ve gone for the &ldquo;sure-bet&rdquo; in the Existentialism course this semester.
</p>


<div class="tagline" id="org9bbf310">
<p>
Tagged: <a href="../tags/quotes.html">Quotes</a> <a href="../tags/religion.html">Religion</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 27, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
